#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// FIXME: убрать тестовые данные
	ТестовыеДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЧтениеСправки(Команда)
	ЧтениеСправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБазу(Команда)
	ОчиститьБазуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоступныеПлатформы(Команда)
	
	Объект.Платформы1С.Очистить();
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДоступныеПлатформыОкончание", ЭтотОбъект);
	НачатьПоискФайлов(Оповещение, Объект.ПутьДоКаталогаСправки, "*"); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДоступныеПлатформыОкончание(Результат, ДополнительныеПараметры) Экспорт
	
	//Каталоги = НайтиФайлы(Объект.ПутьДоКаталогаСправки, "*");
	Для Каждого Каталог Из Результат Цикл
		
		Если Лев(Каталог.Имя, 1) <> "8" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяВерсии = "Версия_" + СтрЗаменить(Каталог.Имя, ".", "_");
		
		НоваяСтрока = Объект.Платформы1С.Добавить();
		НоваяСтрока.Платформа = ПредопределенноеЗначение("Перечисление.ВерсииПлатформы." + ИмяВерсии);
		НоваяСтрока.КаталогСоСправкой = Каталог.ПолноеИмя; 
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОчиститьБазуНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ОчиститьБазу();
		
КонецПроцедуры

&НаСервере
Процедура ЧтениеСправкиНаСервере()

	ИмяКниги = "shcntx_ru.hbk";
	Для Каждого СтрокаПлатформы Из Объект.Платформы1С Цикл
		ПолныйПуть = СтрокаПлатформы.КаталогСоСправкой + "\" + ИмяКниги;
		ПрочитатьКнигуНаСервере(ПолныйПуть, СтрокаПлатформы.Платформа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКнигуНаСервере(ПутьДоКниги, ВерсияПлатформы)	
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ПрочитатьКнигу(ПутьДоКниги, ВерсияПлатформы);
	
КонецПроцедуры

&НаСервере
Процедура ТестовыеДанные()
	Объект.ПутьДоКаталогаСправки = "D:\DATA\Develop\1c-context\graber\depo";	
КонецПроцедуры

#КонецОбласти