#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТестовыеДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЧтениеСправки(Команда)
	ЧтениеСправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБазу(Команда)
	ОчиститьБазуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьБазуНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ОчиститьБазу();
		
КонецПроцедуры

&НаСервере
Процедура ЧтениеСправкиНаСервере()

	ИмяКниги = "shcntx_ru.hbk";	
	ПолныйПуть = Объект.ПутьДоКаталогаСправки + "\" + ИмяКниги;
	ПрочитатьКнигуНаСервере(ПолныйПуть);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьКнигуНаСервере(ПутьДоКниги)	
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ПрочитатьКнигу(ПутьДоКниги, ВерсияПлатформы);
	
КонецПроцедуры

&НаСервере
Процедура ТестовыеДанные()
	Объект.ПутьДоКаталогаСправки = "D:\DATA\Develop\1c-context\graber\tmp";	
	ВерсияПлатформы = Перечисления.ВерсииПлатформы.Версия_8_3_10;	
КонецПроцедуры
#КонецОбласти